Revit 2027 API
ExporterIFCUtils.GetUnscaledTransform Method
 Obtains the exact unscaled transform from an IfcLocalPlacement handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Transform GetUnscaledTransform(
	ExporterIFC exporterIFC,
	IFCAnyHandle placement
)
Public Shared Function GetUnscaledTransform (
	exporterIFC As ExporterIFC,
	placement As IFCAnyHandle
) As Transform
public:
static Transform^ GetUnscaledTransform(
	ExporterIFC^ exporterIFC,
	IFCAnyHandle^ placement
)
static member GetUnscaledTransform :
        exporterIFC : ExporterIFC *
        placement : IFCAnyHandle -> Transform
Parameters
exporterIFC ExporterIFC
 The exporter.
placement IFCAnyHandle
 The placement handle.
Return Value
Transform
 The transform.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace